# Minimal Dotfiles Brewfile
# Essential tools for a clean macOS setup

# Taps
tap "homebrew/autoupdate"
tap "localsend/localsend"

# Essentials
brew "git"
brew "gh"
brew "curl"
brew "coreutils"

# Modern CLI tools (for aliases)
brew "eza"
brew "ripgrep"
brew "dust"
brew "bottom"
brew "duf"
brew "fzf"
brew "zoxide"

# Zsh enhancements
brew "zinit"
brew "powerlevel10k"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Media & Tools
brew "ffmpeg"
brew "parallel"
brew "scrcpy"
brew "mozjpeg"
brew "yt-dlp"
brew "nvm"

# Python
brew "pipx"

# Casks
cask "brave-browser"
cask "android-platform-tools"
cask "ghostty"
cask "handbrake-app"
cask "iina"
cask "keka"
cask "kekaexternalhelper"
cask "paintbrush"
cask "stats"
cask "tg-pro"
cask "visual-studio-code"
cask "localsend/localsend/localsend"

# VS Code Extensions
vscode "davidanson.vscode-markdownlint"
vscode "mikestead.dotenv"
vscode "tamasfe.even-better-toml"
vscode "ms-playwright.playwright"
