# Core CLI
git
github-cli
curl
wget
openssh

# Build tools
base-devel

# Modern CLI replacements
eza
ripgrep
jq
yq
sd
dust
bottom
duf
fzf
zoxide
fd

# Shell
zsh
zsh-completions

# Media pipeline
ffmpeg
parallel
zstd
unarchiver
yt-dlp
aria2

# Image optimization
oxipng
pngquant

# Dev tools
python-pipx
python-pip
python
nodejs
npm
gcc
make

# GUI apps
ghostty
handbrake
android-tools

# System utilities
pacman-contrib
reflector
libnotify
mission-center
psensor

# NVIDIA extras (base nvidia-open/nvidia-utils installed by EndeavourOS)
lib32-nvidia-utils
nvidia-settings
libva-nvidia-driver

# Wayland clipboard + desktop integration
wl-clipboard
xdg-utils

# Vulkan
vulkan-icd-loader
lib32-vulkan-icd-loader

# GPU monitoring
nvtop

# Gaming
steam
lutris
wine
wine-mono
wine-gecko
winetricks
gamemode
lib32-gamemode
mangohud
lib32-mangohud
gamescope

# Gaming audio/video dependencies
lib32-pipewire
pipewire-alsa
lib32-alsa-lib
lib32-alsa-plugins
gst-plugins-base
gst-plugins-good
gst-plugins-bad
gst-plugins-ugly
gst-libav


# Gaming libs
lib32-libva
lib32-libpulse
lib32-gtk3
